from absbox.local.china import SPV

JY_RMBS_01 = SPV(
    "建元"
    ,{"封包日":"2022-10-02","起息日":"2022-10-02","首次兑付日":"2022-11-02"
      ,"法定到期日":"2060-12-01","收款频率":"月末","付款频率":["每月",2]}     
    ,{"清单":[["按揭贷款"
          ,{"放款金额":18_000_000_000,"放款利率":["固定",0.0485],"初始期限":180
          ,"频率":"每月","类型":"等额本息","放款日":"2020-06-01"}
          ,{"当前余额":17_000_000_000
          ,"当前利率":0.04
          ,"剩余期限":180
          ,"状态":"正常"}]]
     }
    ,(("本金分账户",{"余额":0})
      ,("储备账户",{"余额":0})
      ,("收入分账户",{"余额":0})
      ,("信托税收",{"余额":0}))
    ,(("A1",{"当前余额":3_000_000_000
                             ,"当前利率":0.03
                             ,"初始余额":3_000_000_000
                             ,"初始利率":0.03
                             ,"起息日":"2020-01-03"
                             ,"利率":{"浮动":[0.04,"LPR5Y",0.01,["每年",3,1]]}
                             ,"债券类型":{"过手摊还":None}
                            })
      ,("A2",{"当前余额":5_000_000_000
                             ,"当前利率":0.03
                             ,"初始余额":5_000_000_000
                             ,"初始利率":0.03
                             ,"起息日":"2020-01-03"
                             ,"利率":{"浮动":[0.05,"LPR5Y",0.02,["每年",3,1]]}
                             ,"债券类型":{"过手摊还":None}
                            })
      ,("A3",{"当前余额":6_999_000_000
                             ,"当前利率":0.03
                             ,"初始余额":5_000_000_000
                             ,"初始利率":0.03
                             ,"起息日":"2020-01-03"
                             ,"利率":{"浮动":[0.06,"LPR5Y",0.03,["每年",3,1]]}
                             ,"债券类型":{"过手摊还":None}
                            })
      ,("次级",{"当前余额":2_123_875_534.53
                             ,"当前利率":0.03
                             ,"初始余额":2_123_875_534.53
                             ,"初始利率":0.03
                             ,"起息日":"2020-01-03"
                             ,"利率":{"固定":0.0}
                             ,"债券类型":{"过手摊还":None}
                            }))
    ,(("增值税",{"类型":{"百分比费率":["资产池当期","利息",0.0325]}})
      ,("服务商费用",{"类型":{"年化费率":["资产池余额",0.02]}}))
    ,{"未违约":[
         ["支付费用","收入分账户",["服务商费用"],{"应计费用百分比":0.5}]
         ,["计提支付利息","收入分账户",["A1","A2","A3"]]
         ,["支付费用","收入分账户",["服务商费用"]]
         ,["账户转移","收入分账户","本金分账户"]
         ,["支付本金","本金分账户",["A1"]]
         ,["支付本金","本金分账户",["A2"]]
         ,["支付本金","本金分账户",["A3"]]
         ,["支付本金","本金分账户",["次级"]]
         ,["支付收益","本金分账户","次级"]],
     "回款后":[["计提费用","增值税"]]
     }
    ,(["利息回款","收入分账户"]
      ,["本金回款","本金分账户"]
      ,["早偿回款","本金分账户"]
      ,["回收回款","本金分账户"])
    ,None
    ,None
    ,None
    ,None
    ,("设计","摊销")
)


#myAssumption = [{"CPR":0.01}
#                ,{"回收":(0.5,10)}
#                ,{"CDR":0.00}
                #,{"清仓":[{"指定日之后":"2021-11-28"}]}
#                ,{"利率":["LPR5Y",[["2022-01-01",0.05],["2023-01-01",0.07],["2024-01-01",0.09]]]}
#               ]
        
#r = localAPI.run(JY_RMBS_01
#             ,assumptions= myAssumption  
#             #,pricing={"贴现日":"2022-06-22","贴现曲线":[["2020-01-01",0.025]]}                 
#             ,read=True)
