from absbox.local.china import SPV

test01 = SPV(
    "Apply Assumption on Loan Level"
    ,{"封包日":"2021-03-31","起息日":"2021-06-15","首次兑付日":"2021-07-26"
      ,"法定到期日":"2060-12-01","收款频率":"月末","付款频率":["每月",26]}
    ,{'清单':[
        ["按揭贷款"
        ,{"放款金额":120,"放款利率":["固定",0.045],"初始期限":30
          ,"频率":"每月","类型":"等额本金","放款日":"2021-02-01"}
          ,{"当前余额":120
          ,"当前利率":0.08
          ,"剩余期限":20
          ,"状态":"正常"}],
        ["按揭贷款"
        ,{"放款金额":60,"放款利率":["固定",0.045],"初始期限":30
          ,"频率":"每月","类型":"等额本金","放款日":"2021-02-01"}
          ,{"当前余额":60
          ,"当前利率":0.08
          ,"剩余期限":20
          ,"状态":"正常"}],    
    ]}
    ,(("账户01",{"余额":0}),)
    ,(("A1",{"当前余额":100
             ,"当前利率":0.07
             ,"初始余额":100
             ,"初始利率":0.07
             ,"起息日":"2020-01-03"
             ,"利率":{"固定":0.08}
             ,"债券类型":{"过手摊还":None}})
      ,("B",{"当前余额":20
             ,"当前利率":0.0
             ,"初始余额":100
             ,"初始利率":0.07
             ,"起息日":"2020-01-03"
             ,"利率":{"固定":0.00}
             ,"债券类型":{"权益":None}
             }))
    ,(("信托费用",{"类型":{"固定费用":30}}),)
    ,{"未违约":[
         ["支付费用","账户01",['信托费用']]
         ,["计提支付利息","账户01",["A1"]]
         ,["支付本金","账户01",["A1"]]
         ,["支付本金","账户01",["B"]]
         ,["支付收益","账户01","B"]
     ]}
    ,(["利息回款","账户01"]
      ,["本金回款","账户01"]
      ,["早偿回款","账户01"]
      ,["回收回款","账户01"])
    ,None
    ,None
    ,None
    ,None
    ,("设计","摊销")
)

Asset01Assump = [{"CPR":0.1}
                ,{"回收":(0.5,1)}
                ,{"CDR":0.0}]

Asset02Assump = [{"CPR":0.1}
                ,{"回收":(0.5,1)}
                ,{"CDR":0.01}]


myAssumption = ["明细",
                [([0],Asset01Assump),([1],Asset02Assump)],
                [{"利率":["LPR5Y",["2020-01-01",0.05]]}]]


#r = localAPI.run(test01
#             ,assumptions= myAssumption             
#             ,read=True)


#r['pool']['flow']
